app/Http/Controllers/Auth/RegisterController.php

protected function create(array $data)
{
    try {
    //    dd($data);
        // Start a database transaction
        DB::beginTransaction();

        // User aanmaken
        $user = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => Hash::make($data['password']),
            'phone_number' => $data['phoneNumber'],
        ]);
---
insert into `users` (`name`, `email`, `password`, `phone_number`, `role`, `updated_at`, `created_at`) values ('Testpersoon2', 'jfjfjfjfj@gmail.com', '$2y$10$/MtjapZfC0QSvyQSYo2GoOoaKFiqXw1f8EdAR.Vg6yimGT.jjaUYy', '0615176837', 'lid', '2023-06-08 11:41:58', '2023-06-08 11:41:58')