app/Http/Controllers/AdminApprovalController.php

select * from `users` where `is_approved` = 0
---
    public function index()
    {
        $users = User::where('is_approved', false)->get(); // Haal de gebruikers op die nog niet zijn goedgekeurd

update `users` set `is_approved` = 1, `users`.`updated_at` = '2023-06-08 11:42:14' where `id` = 4
---
    public function approve(User $user)
    {
        $user->is_approved = true;
        $user->save(); // Keur de gebruiker goed en sla het op

select * from `task`
---
    public function getAssignmentRequests()
    {
        $tasks = Task::get(); // Haal de opdrachten op die nog niet geaccepteerd zijn

update `task` set `status` = 'lopend', `task`.`updated_at` = '2023-06-08 11:17:08' where `id` = 3
select * from `users` where `id` = 1
---
    public function approveAssignment(Task $task)
    {
        $task->status = 'lopend';
        $task->save(); // Keur de opdracht goed en sla het op
        $user = User::find($task->client_id);