app/Http/Controllers/UserController.php

select * from `user_task` where `user_id` = 4
---
    public function index()
    {
        $userTasks = UserTask::where('user_id', Auth::id())->get();

update `user_task` set `status` = 'geweigerd', `user_task`.`updated_at` = '2023-06-08 12:46:50' where `id` = 1
---
    public function accept(UserTask $userTask)
    {
        $userTask->status = 'geaccepteerd';
        $userTask->save(); // Accepteer de opdracht goed en sla het op